$(document).ready(function () {

//////////////////////////////////////////////////
////                                          ////
////                Переменные                ////
////                                          ////
//////////////////////////////////////////////////

    // Форма создания стратегии
    if ($('div#strategy').length) {
        $('button#strategy_addSignal').on("click", function () {
            addSignal();
        });
    }


///////////////////////////////////////////////
////                                       ////
////                События                ////
////                                       ////
///////////////////////////////////////////////


///////////////////////////////////////////////
////                                       ////
////         Запускаемые процедуры         ////
////                                       ////
///////////////////////////////////////////////


});

///////////////////////////////////////////////
////                                       ////
////                Функции                ////
////                                       ////
///////////////////////////////////////////////

function addSignal() {
    var $strategySignals = $('div#strategy-signals'),
        html = '<div></div>';

    $strategySignals.append(html);
}
